#!/usr/bin/env python3
# -*- coding: utf-8 -*-

__author__ = "jerry chan"
__doc__ = """ 切片 """
__date__ = "2024/9/27 00:03"

if __name__ == "__main__":
    l1 = list(range(10))

    print(f'li: {l1}')

    # 切片
    # 所有元素，相当于复制列表
    print(f'l1[:]: {l1[:]}')
    # 从索引1开始，到索引5结束，不包括索引5
    print(f'l1[1:5]: {l1[1:5]}')
    # 从索引1开始，到索引5结束，不包括索引5
    print(f'l1[1:5]: {l1[1:5]}')
    # 每两个元素，取一个元素
    print(f'l1[::2]: {l1[::2]}')
    # 从索引1开始，到最后一个元素结束，每三个元素，取一个元素
    print(f'l1[1:9:3]: {l1[1:9:3]}')
    # 倒序复制列表
    print(f'l1[::-1]: {l1[::-1]}')
    # 倒序每两个元素取一个元素
    print(f'l1[::-2]: {l1[::-2]}')
